# !/usr/bin/env python
# -*- coding: utf-8 -*-
# __author__ = 'qiuzixian'  http://blog.csdn.net/qqzhuimengren/   1467288927@qq.com
# @time          :2018/1/3  13:09
# @abstract    :

from zonghengtxt.DataOutput import DataOutput

output = DataOutput()

undoFic = {'恶魔手机': '', '第一公主': '', '古城晚秋': '', '女流氓的罗曼史': '', '万界仙王': '', '傲娇甜妻哪里逃': '', '位面小蝴蝶': '', '妙手药师': '', '超神英雄传': '', '家有仙师太妖娆': '', '红包万岁': '', '仙都': '', '天下为聘': '', '第一仙': '', '武逆神荒': '', '妖影': ''}
ficNames = undoFic.keys()
allCharpter =  output.loadJson("免费小说首页")
print(allCharpter)
for item in allCharpter:
	print(item["tabtitle"])
	for tabList in item["tablists"]:
		if tabList["ficName"] in ficNames:
			print(tabList)
		# undoFic.append(tabList["ficName"])
# print(undoFic)
# crawlFic = ['海上封神记', '海上封神记', '俗人的奋斗', '透视之瞳', '调香高手', '我是大神壕', '我是大神壕', '剑佣', '绝命毒尸', '绝命毒尸', '愤怒的青年', '调香高手', '轮回锻造师', '特战之王', '妖影', '轮回锻造师', '妖影', '万界仙王', '大漕商', '神都夜行录', '卡尔戏三国', '剑佣', '大漕商', '众神聊斋', '有仙来', '神都夜行录', '众神聊斋', '特战之王', '透视之瞳', '愤怒的青年', '卡尔戏三国', '俗人的奋斗', '无上圣王', '仙侠世界', '唯我剑尊', '星际传奇', '天神下凡', '拳镇山河', '万妞不挡之勇', '绝品兵王', '桃花', '龙神决', '透视之瞳', '妖影', '超神英雄传', '海上封神记', '特战之王', '卡尔戏三国', 'AI前行', '第一仙', '我是大神壕', '绝命毒尸', '恶魔手机', '万界仙王', '绝命毒尸', '恶魔手机', '盛唐风华', '红包万岁', '特战之王', '妖影', '万界仙王', '海上封神记', '神都夜行录', '卡尔戏三国', '唐朝生意人', 'AI前行', '以庶为贵', '众神聊斋', '神都夜行录', '透视之瞳', '丹道武神', '盛唐风华', '狼群帝国', '异世尊者纵横', '舍我其谁', '锐气风暴', '众神王座', '位面小蝴蝶', '血神笑', '武动九霄', '超幻想世界', '三国之刘尚传', '轮回锻造师', '透视之瞳', '绝命毒尸', '神都夜行录', '愤怒的青年', '众神聊斋', '特战之王', '调香高手', '我是大神壕', '俗人的奋斗', '家有仙师太妖娆', '天下为聘', '古城晚秋', '妙手药师', '第一公主', '众神王座', '武逆神荒', '傲娇甜妻哪里逃', '女流氓的罗曼史', '仙都', '家有仙师太妖娆', '天下为聘', '古城晚秋', '妙手药师', '第一公主', '众神王座', '武逆神荒', '傲娇甜妻哪里逃', '女流氓的罗曼史', '仙都', '天下节度']
# DoneFic = ['三国之刘尚传', '众神王座', '异世尊者纵横', '武动九霄', '狼群帝国', '舍我其谁', '血神笑', '超幻想世界', '锐气风暴', '调香高手', '神都夜行录', '绝命毒尸', '特战之王', '透视之瞳', '我是大神壕', '愤怒的青年', '俗人的奋斗', '轮回锻造师', '众神聊斋', '仙侠仙都', '仙侠家有仙师太妖娆', '传奇古城晚秋', '奇幻众神王座', '婚恋女流氓的罗曼史', '架空第一公主', '玄幻武逆神荒', '豪门傲娇甜妻哪里逃', '都市妙手药师', '唯我剑尊', '仙侠世界', '无上圣王', '天神下凡', '桃花', '拳镇山河', '星际传奇', '万妞不挡之勇', '龙神决', '绝品兵王', '大漕商', '卡尔戏三国', '特战之王', '俗人的奋斗', '众神聊斋', '众神聊斋', '剑佣', '愤怒的青年', '有仙来', '神都夜行录', '透视之瞳', '神都夜行录', '以庶为贵', 'AI前行', '海上封神记', '丹道武神', '众神聊斋', '卡尔戏三国', '唐朝生意人', '盛唐风华', '神都夜行录', '透视之瞳', '天下节度']
#
# undoFic ={item:"" for item in {ficName for ficName in crawlFic if ficName not in DoneFic}}
# print(undoFic)
# tabLists = {}
# for item in allCharpter:
# 	for tabList in item["tablists"]:
# 		if tabList["ficName"]  not in tabLists:
# 			tabLists[tabList["ficName"]] = tabList["href"]
# undoFic ={ficName: tabLists[ficName] for  ficName in ficNames}
# print(undoFic)
